export default {
  printWidth: 100, // Максимальная длина строки
  singleQuote: false, // Все двойные кавычки будут преобразованы в одинарные
  trailingComma: "all", //  Обеспечивает наличие запятой после последнего свойства объекта
  bracketSpacing: true, // Отвечает за вставку пробелов между телом объекта и фигурными скобками в объектных литералах.
  jsxBracketSameLine: true, // благодаря этому правилу символ `>` в многострочных JSX-элементах будет помещён в последней строке.
  tabWidth: 2, // Задаёт количество пробелов на один уровень выравнивания.
  semi: true, // Если это правило установлено в `true`, то в конце выражений добавляется точка с запятой.
};
